{
  "movies": [
    {
      "title": "Deadly Fight",
      "views": "10M",
      "genre": "Action",
      "image": "../../../assets/deadly_fight.jpg",
      "duration": "00:56:00",
      "plot": "A young woman commits murder to keep her classmates' social media careers under her thumb. After killing a popular friend, she turns her sights on a new girl, but the girl's mother suspects the truth and will fight to protect her daughter."
    },
    {
      "title": "Jumanji",
      "views": "3M",
      "image": "../../../assets/jumanji.jpg",
      "genre": "adventure",
      "duration": "01:05:00",
      "plot": "In Brantford, New Hampshire (1996), teenager Alex Vreeke is given the Jumanji board game by his father, who found it on a beach after it was thrown into a river by Alan Parrish and Sarah Whittle 27 years earlier. Uninterested, Alex sets the game aside. That night, it transforms into a video game cartridge which catches Alex's attention when he is awakened by the Jumanji drum beats. When he begins playing it, he disappears into the game. Twenty years later, four students at Brantford High School are given detention: Spencer Gilpin and his ex-best friend Anthony 'Fridge' Johnson due to Spencer doing Fridge's homework, Bethany Walker for calling her friend Lucinda during class and talking back to her teacher, and Martha Kaply for insulting Coach Webb and refusing to participate in PE. In the school basement, where they are serving their detention, Fridge discovers Alex's discarded video-game system, and he and Spencer decide to play. Although it has five playable characters, they are unable to select the first one, so they choose two others and convince the girls to play as the remaining two. As they begin, the four are sucked into the game. They land in a jungle in the forms of their game avatars. Spencer is a tough, muscular explorer and archaeologist named Dr. Smolder Bravestone. Fridge is a diminutive zoologist named Franklin 'Mouse' Finbar. Bethany is an overweight male cartographer named Professor Sheldon 'Shelly' Oberon. Martha is a female commando and martial arts expert named Ruby Roundhouse. They each have three lives marked on their arms and Bethany immediately loses one after being eaten by a hippo. Spencer deduces that if they lose all three, they die in real life. They learn the game's story from NPC Nigel: corrupt archeologist Russell Van Pelt stole the Jaguar's Eye, a magic jewel, from its shrine. Van Pelt became possessed by its power, which placed all the jungle's animals under his control, cursing Jumanji. Nigel escaped Van Pelt with the jewel, and the players must return it to the jaguar statue to lift the curse and call 'Jumanji' to leave the game, warning them that Van Pelt will stop at nothing to retrieve the jewel. They begin tackling the game's increasingly-difficult 'levels', losing lives as they do so. The four are rescued by Alex, the missing fifth player, whose avatar is pilot Jefferson 'Seaplane' McDonough. Taking shelter in a jungle house built by the game's previous player, Alan Parrish, Alex believes that he has been in the game for a few months and is distressed to learn that it has really been twenty years. The newcomers vow to help him return home. They break into a transportation shed, commandeering a helicopter, but Fridge drops the jewel into a herd of rhinos. Spencer sacrifices one of Fridge's lives by pushing him out of the helicopter as a distraction and retrieves the jewel. Alex loses his last life when a mosquito bites him, but Bethany performs CPR and transfers one of her lives to him. Arriving at a path leading to the statue, the players are surrounded by a pack of jaguars and Van Pelt's forces. They outmaneuver their opposition while Spencer and Martha race to the statue. Van Pelt confronts Martha and demands the jewel, but she purposely gets a snake to bite her, allowing her to respawn and to get the jewel to Spencer. Now on their last lives, the players end the game, with Van Pelt disintegrating into a bunch of rats, and return to the school basement, though without Alex. They find the formerly-dilapidated Vreeke home restored and decorated for a Christmas family gathering. An adult Alex arrives, having returned to 1996 when the game ended. Now married with children, he reveals he named his eldest daughter after Bethany out of gratitude for saving his life. The four are now friends after their experiences in the game. Spencer and Fridge reconcile, Bethany begins caring for others more than herself and plans a summer wilderness backpacking adventure and Martha and Spencer become romantically involved. When they hear Jumanji's drumbeats, they bring the game behind the school, and Fridge destroys it with a bowling ball to prevent anyone from playing it."
    },
    {
      "title": "Siberia",
      "views": "30M",
      "genre": "Love/Action",
      "image": "../../../assets/siberia.jpg",
      "duration": "02:05:00",
      "plot": "American diamond merchant Lucas Hill (Keanu Reeves) travels to Russia to sell rare blue diamonds to gangster Boris Volkov (Pasha D.Lychnikoff). However, his contact in St. Petersburg, Pyotr (Boris Gulyarin) who had the diamonds has gone missing. Boris threatens Lucas to deliver the diamonds in 48 hours. Following Pyotr's clues, Lucas arrives at a guest house in Mirny, Siberia. He contacts his wife Gabby (Molly Ringwald) through Skype. He goes to a cafe and starts a fight with two men and the cafe owner Katya (Ana Ularu) saves him. Later, her brother Ivan suspects her of sleeping with Lucas. So she asks him to sleep with her. Lucas meets Pyotr's brother Andrei who tells him that Pyotr sold the diamonds to a man named Samsonov. Enraged, Lucas goes to Katya's home. They start a passionate affair. Lucas also goes bear hunting with Ivan and Katya's other brothers. Lucas is contacted by Vincent but he turns him off. Lucas returns to Pyotr's apartment in St. Petersburg to find a diamond there. That is real. He checks the one Pyotr sent to him. It's a fake. Lucas meets Boris, along with Katya to show the diamond promising him to return the rest later. Boris seals their deal by becoming brothers by making Lucas force Katya to fellate Boris. Lucas is met by FSB agents who make Lucas sell fake diamonds, the ones Pyotr tried to sell to Samsonov, to Boris and get the money to the agents. In return, they promise him safe passage to home. Lucas overhears them speaking that once Boris finds out, he will kill his wife and Katya and Lucas won't hide long. Lucas manages to make Boris buy the diamonds and wire the money to the agents' account. But he gets a fair warning from Boris' henchman Pavel of the consequences if he is betraying. Lucas finds where Pyotr is hiding in Siberia. He goes there to find Pyotr dead and no way to retrieve the real diamonds. Lucas meets Katya one last time and borrows Ivan's hunting rifle, knowing there is no other way this could end. Pavel and a few henchmen find Lucas to the place. Lucas shoots and kills all the henchmen while trying to escape but gets shot by Pavel in the back and dies."
    },
    {
      "title": "John Wick",
      "views": "100M",
      "genre": "Virtual Reality",
      "image": "../../../assets/john_wick.jpg",
      "duration": "03:05:00",
      "plot": "After John Wick loses his wife, Helen, to a terminal illness, he receives a beagle puppy named Daisy from his late wife to help him cope with his grief. Despite John's stoic demeanor, he bonds with the puppy and they spend their day driving around in his vintage 1969 Ford Mustang Mach 1. At a gas station he encounters a trio of Russian gangsters whose leader, Iosef, insists on buying his car, but John repeatedly states that it is not for sale. Angered, the mobsters follow John to his home, knock him unconscious, steal his car and kill Daisy. Iosef takes the Mustang to a chop shop to have the VIN changed. Aurelio, the shop's owner, recognizes the car and, upon learning that Iosef stole it from John, punches him before throwing him out of his shop. John visits Aurelio, who identifies Iosef as the son of Viggo Tarasov, the head of the Russian crime syndicate in New York City. Viggo, informed by Aurelio of Iosef's activities, beats and berates Iosef before explaining to him who John Wick is: a famed assassin formerly in Viggo's employ, nicknamed 'Baba Yaga' (translated in the film as Russian for 'Boogeyman'). When John wanted to retire and marry Helen, Viggo gave him an 'impossible task,' implied to involve multiple assassinations in a short period of time. John succeeded, and his efforts were key in establishing the Tarasov syndicate. Viggo tries to talk John out of seeking retribution, but John refuses. Viggo then sends a thirteen-man hit squad to John's house, but John kills them all and has the bodies professionally removed. An unsurprised Viggo places a $2 million bounty on John's head and personally offers the contract to John's mentor, Marcus. John seeks refuge at the Continental Hotel, which caters exclusively to the criminal underworld and permits no 'business' on its premises. Viggo doubles the bounty for those willing to break the rules to kill John at the Continental. Winston, the Continental's owner, tells John that Viggo has Iosef under guard at his nightclub, the Red Circle. John enters the Red Circle and kills his way to Iosef but Viggo's henchman, Kirill, waylays John, allowing Iosef to escape. John retreats to the Continental to patch up his injuries. Ms. Perkins, an assassin and former acquaintance, sneaks into John's room to kill him but Marcus alerts John, allowing him to subdue Perkins. He forces Perkins to reveal the location of Viggo's front, knocks her unconscious and leaves her with Harry, a fellow assassin, to await punishment. However, Perkins frees herself and kills Harry. John travels to the Little Russia church which serves as Viggo's front and destroys Viggo's cache of money and blackmail material. When Viggo and his team arrive, John ambushes them, but is subdued and captured. Viggo taunts John for thinking he could leave his old life behind. Marcus intervenes again, allowing John to free himself and to kill Kirill before accosting Viggo, who reveals Iosef's location. John then travels to the safe house and kills Iosef and his bodyguards. Perkins learns that John and Marcus have been in contact and tells Viggo, who has Marcus beaten and tortured before executing him in his home. Viggo calls John to report this, planning to have Perkins ambush him. While waiting for John, Perkins is called to a meeting with Winston, who has her executed for killing Harry on Continental grounds. Winston calls John to inform him that Viggo is planning to escape by helicopter. John races to the harbor helipad, where he kills Viggo's remaining henchmen before engaging Viggo in a brawl on the dock. Viggo pulls a knife, and John allows himself to be stabbed, surprising Viggo. John then disarms Viggo and fatally wounds him. John breaks into a waterfront animal clinic to treat his wound and releases a pit bull puppy scheduled to be euthanized. John and the dog walk home along the boardwalk where he had his last date with Helen."
    },
    {
      "title": "BattleShip",
      "views": "30M",
      "genre": "Sci-fi",
      "image": "../../../assets/battleship.jpg",
      "duration": "02:02:56",
      "plot": "In 2006, the distant Gliese planetary system is discovered to have a potentially habitable planet and a communications array is built by NASA in Hawaii to send a transmission to contact any intelligent life. Meanwhile, Alex Hopper is arrested while attempting to impress Sam Shane. His brother, naval officer Stone, forces Alex to join the U.S. Navy in order to improve his life. In 2012, Alex and Sam are in a relationship; Alex serves as a Tactical Actions Officer as a lieutenant aboard USS John Paul Jones while Stone is the commander aboard USS Sampson, but Alex is in danger of receiving a disciplinary discharge. During the 2012 RIMPAC exercise, five alien spacecraft arrive. Their communications ship collides with a satellite and crashes in Hong Kong while the other four land in the waters off Hawaii. Sampson, John Paul Jones, and their Japanese sister ship JDS Myōkō are ordered by Admiral Terrance Shane to investigate, and they discover a floating structure. When it is touched by Alex it generates a force field that encloses the Hawaiian Islands and separates the three ships from the RIMPAC fleet, and jams all radar and communication equipment in it. Three alien warships surface and in the ensuing engagement, the Sampson and Myōkō are both destroyed, resulting in Stone's death, while the command crew of John Paul Jones are killed. With Alex assuming command of the ship as the ranking officer, they recover the survivors from Myōkō including its commanding officer, Captain Yugi Nagata. The aliens also launch drones to attack Hawaii which cause heavy damage. On Oahu, Sam is accompanying retired U.S. Army lieutenant colonel and double amputee Mick Canales on a mountain hike. After becoming aware of the aliens' presence, they encounter scientist Cal Zapata who informs them the aliens have taken over the communications array, and Mick determines that they are planning to use it to re-establish military communications with their home planet. Aboard John Paul Jones, naval personnel capture a semi-conscious alien. The alien forms a telepathic link with Alex, showing him their history of destroying worlds. Other aliens arrive and retrieve their comrade, but are prevented from sabotaging the ship. Examination of the captured alien's helmet reveals the aliens are sensitive to sunlight. Ashore, Sam, Nick and Zapata recover his spectrum analyzer from the aliens and they use it to radio John Paul Jones to inform them the aliens intend military telecommunication with their home planet in four hours. As night falls Captain Nagata suggests to use National Oceanic and Atmospheric Administration's tsunami warning buoys around Hawaii to track the alien warships. This allows John Paul Jones to destroy two of them. At dawn, they lure the remaining warship eastwards as Alex and Nagata shoot out its bridge windows, blinding its crew and allowing John Paul Jones to destroy it, but John Paul Jones is subsequently sunk by alien drones. The survivors return to Pearl Harbor and commandeer the previously decommissioned World War II battleship USS Missouri with the aid of the retired veterans preserving her, restoring her to battle readiness and confronting the floating structure, revealed to be a giant mothership. Missouri is able to severely damage the mothership and disable the force field, and Admiral Shane scrambles a flight of Boeing F/A-18 fighter jets from aircraft carrier USS Ronald Reagan. Meanwhile, Sam, Mick and Cal attempt to stall the aliens at the communications array. As Alex uses their last shell to destroy the communications array, the foundering mothership launches a pair of drones at the Missouri. Just before impact, the drones are intercepted and destroyed by Australian fighter jets, saving Missouri and eliminating the alien threat. A ceremony is held to honor the military personnel, where Alex is promoted to lieutenant commander and presented with both a Silver Star and his brother's posthumous Navy Cross. After the ceremony, Alex asks Sam's father Admiral Shane for her hand in marriage. The admiral refuses, but shortly after, referencing how Alex and Sam met, invites Alex to lunch to discuss the matter. In a post-credits scene, three teenagers and a handyman in Scotland discover a crashed alien pod. When they open it, an alien hand reaches out, and they run off in terror."
    },
    {
      "title": "Love and BasketBall",
      "views": "1M",
      "genre": "Love",
      "image": "../../../assets/love_and_basketball.jpg",
      "duration": "02:10:34",
      "plot": "Monica and Quincy have wanted to be professional basketball stars since they were kids. The two became childhood sweethearts in 1981, when Monica’s family moved to Los Angeles from Atlanta, moving into the house next door to Quincy’s. Quincy's father, Zeke, is the star shooting guard for the Los Angeles Clippers. Quincy is shocked that a girl could love basketball as much as he does, and can play so well. They share their first kiss on the first day of school. The story jumps to 1988, when both Monica and Quincy are the respective leaders of their high school teams, with Quincy touted as one of the top prospects in the country. While popular with the girls, he and Monica are still good friends. Monica, on the other hand, struggles with her fiery emotions on the court, often resulting in technical fouls at critical moments of games, damaging potential scouting opportunities. Monica also struggles with the emotions she secretly still harbors for Quincy. She also struggles with her mother, Camille, pressuring her to give up basketball and 'act like a lady.' Through soul searching, Monica learns to control her emotions and leads her team to the state championship game. When she and her team came up short, Monica feels devastated. Monica begins to recover from the championship loss with the help of her older sister, Lena, who gives her a makeover. She even finds Monica a college friend to take her to her spring dance. Despite having a date of his own, Quincy notices Monica and compliments her new appearance. Later that night, they both speak outside her window and reveal to each other how their dates didn't meet their needs. Monica asks Quincy to open her letter from USC – which reveals she has been accepted. Quincy has accepted an offer from USC as well, and they celebrate with a kiss. This leads to them finally acting on their feelings, making love that night. The story moves to their freshman year at USC, where they are managing themselves as athletes, students, and a couple. While Quincy finds instant success on the court, Monica struggles for playing time, behind senior guard Sidra O'Neal. Monica has run ins with the head coach, Ellie Davis. Her relationship with Quincy becomes more and more strained. Quincy struggles to deal with the media attention, while clashing against his father’s efforts to convince Quincy to finish college before going pro. While Monica earns the starting point guard spot at the end of the season, Quincy feels she was not there for him when he was having problems with his father, and the couple splits up. The story jumps to 1993. Monica is playing professional basketball with an International Women's Basketball Association (IBWA) team in Barcelona. She misses home, but can't imagine a life that doesn’t include basketball. While Monica leads her team to a dominant victory in the championship game, she starts to realize that her love for basketball isn't the same as it was before. Having left USC after his freshman season, Quincy is now in his fifth year in the pros. He has been traded to the Los Angeles Lakers, but tears his ACL in a game. Monica flies home to see him, and is saddened to meet Quincy's fiancée, Kyra. Monica also falls into the usual squabbles with her mother Camille. Quincy completes physical therapy, while his wedding draws closer. Monica has quit basketball to work at a bank. Seeing how unhappy Monica is, Camille encourages her to fight for her career and the man she loves Quincy and Monica meet and reminisce. Monica challenges him to a game of one-on-one, with high stakes; if he loses, he calls off the wedding and chooses Monica. Quincy agrees and wins, but can no longer be apart from Monica and chooses her instead. The film jumps to 1998. Monica is playing in the new WNBA. Quincy and their baby daughter cheer on Monica during her game."
    },
    {
      "title": "Life",
      "views": "200k",
      "image": "../../../assets/Life.jpg",
      "genre": "Horror",
      "duration": "01:05:00",
      "plot": "In the near future, the unmanned Pilgrim 7 space probe returns from Mars to Earth orbit with soil samples potentially containing evidence of extraterrestrial life. The probe is captured and its samples retrieved by the International Space Station and its six-member crew. Exobiologist Hugh Derry, who is paralyzed from the waist down, revives a dormant cell from the sample, which quickly grows into a multi-celled organism that American school children name 'Calvin.' Hugh realizes that Calvin's cells can change their specialization, acting as muscle, neuron, and photosensory cells all at once. An accident in the lab causes Calvin to become dormant; Hugh attempts to revive Calvin with electric shocks, but Calvin immediately becomes hostile and attacks Hugh, crushing his right hand. While Hugh lies unconscious from Calvin's attack, Calvin uses Hugh's electric shock tool to escape its enclosure; now free in the laboratory, Calvin devours a lab rat by absorbing it, growing in size. Engineer Rory Adams enters the lab to rescue Hugh; however, he is locked in by fellow crew member and physician David Jordan to keep Calvin contained, after it latches onto Rory's leg. He fights Calvin off by burning it with an exposed element from a handheld light. Rory then, unsuccessfully, attacks Calvin with an incinerator component removed from a lab station; Calvin enters his mouth, devouring his organs from the inside and killing him. Emerging from Rory's mouth even larger, Calvin escapes through a fire-control vent that has been set off. Finding their communication with Earth cut off due to overheating of the communication systems, ISS commander Ekaterina Golovkina performs a space walk to find and fix the problem. She discovers that Calvin has breached the ISS's cooling system; soon after, Calvin attacks her, rupturing her spacesuit's coolant system in the process and causing the coolant in the system to fill her suit. She blindly makes her way back to the airlock; however, she and the crew realize that if she re-enters, Calvin will also be able to re-enter the ISS. Hence, she refuses to open the hatch and stops David from helping her do so; this keeps Calvin out of the station for the time being but also causes her to drown and die in her spacesuit. Calvin then attempts to re-enter the station through its maneuvering thrusters. The crew try to fire the thrusters to blast Calvin away from the spacecraft, but their attempts fail, using up too much fuel and causing the ISS to enter a decaying orbit where it will burn up in Earth's atmosphere. Pilot Sho Murakami informs the crew that they need to use the station's remaining fuel to get back into a safe orbit, although this allows Calvin to re-enter the station. The crew plan to make Calvin dormant by sealing themselves into one module and venting the atmosphere from the rest of the station. After the crew finalize preparations to do so, Hugh enters cardiac arrest. The crew then discover that Calvin has been feeding off Hugh's paralyzed leg. Calvin attacks the rest of the crew; Sho seals himself in a sleeping pod. As Calvin tries to break its glass, David and quarantine officer Miranda North use Hugh's corpse as bait to lure Calvin away from Sho and trap it in another module, in order to deprive it of oxygen. Having received a distress call prior to the damage to the ISS's communication system, Earth sends a Soyuz spacecraft to the station as a fail-safe plan to push the station into deep space. Believing the Soyuz to be on a rescue mission for the ISS crew, Sho leaves his pod and moves to board it, forcing open its hatch; Calvin then attacks the Soyuz astronauts and Sho, wrecking the craft's docking mechanisms, resulting in the capsule crashing into the ISS, killing Sho and the Soyuz cosmonauts, and causing the ISS's orbit to decay again. The only two survivors, David and Miranda, aware that Calvin could survive re-entry into Earth's atmosphere, plan for David to lure Calvin into one of the two escape pods attached to the ISS and for David to manually pilot the pod into deep space, isolating Calvin, and allowing Miranda to return to Earth in the other pod. David manages to lure Calvin into his pod, while Miranda enters her pod; as they simultaneously undock their pods from the ISS, one of the pods hits debris and is damaged, veering off course. In David's pod, Calvin attacks him as he struggles to manually pilot the pod; in Miranda's pod, she records a black box message in case of her death during re-entry informing the world of her colleagues' deaths and not to trust Calvin nor any extraterrestrial life from Mars as well as to destroy Calvin at any cost should it make its way to Earth. The two pods separate, one earthbound, the other spiraling away from Earth. The earthbound pod lands in the ocean; two nearby Vietnamese fishermen approach it. As they look into the pod, it is revealed to be David's, with the astronaut now restrained by Calvin, after it has grown to fill the pod compartment. Meanwhile, Miranda's pod's navigation system fails due to damage sustained from the debris, sending her flying away from Earth out of control, much to her horror. On Earth, despite David's attempts to warn them, the fishermen open the pod's hatch, as more boats arrive on the scene."
    }
  ]
}
