{
  "movies": [
    {
      "title": "Deadly Fight",
      "views": "10M",
      "genre": "Action",
      "image": "../../../assets/deadly_fight.jpg",
      "duration": "00:56:00",
      "plot": "A young woman commits murder to keep her classmates' social media careers under her thumb. After killing a popular friend, she turns her sights on a new girl, but the girl's mother suspects the truth and will fight to protect her daughter."
    },
    {
      "title": "Jumanji",
      "views": "3M",
      "image": "../../../assets/jumanji.jpg",
      "genre": "adventure",
      "duration": "01:05:00",
      "plot": "In Brantford, New Hampshire (1996), teenager Alex Vreeke is given the Jumanji board game by his father, who found it on a beach after it was thrown into a river by Alan Parrish and Sarah Whittle 27 years earlier. Uninterested, Alex sets the game aside. That night, it transforms into a video game cartridge which catches Alex's attention when he is awakened by the Jumanji drum beats. When he begins playing it, he disappears into the game. Twenty years later, four students at Brantford High School are given detention: Spencer Gilpin and his ex-best friend Anthony 'Fridge' Johnson due to Spencer doing Fridge's homework, Bethany Walker for calling her friend Lucinda during class and talking back to her teacher, and Martha Kaply for insulting Coach Webb and refusing to participate in PE."
    },
    {
      "title": "Siberia",
      "views": "30M",
      "genre": "Love/Action",
      "image": "../../../assets/siberia.jpg",
      "duration": "02:05:00",
      "plot": "American diamond merchant Lucas Hill (Keanu Reeves) travels to Russia to sell rare blue diamonds to gangster Boris Volkov (Pasha D.Lychnikoff). However, his contact in St. Petersburg, Pyotr (Boris Gulyarin) who had the diamonds has gone missing. Boris threatens Lucas to deliver the diamonds in 48 hours. Following Pyotr's clues, Lucas arrives at a guest house in Mirny, Siberia. He contacts his wife Gabby (Molly Ringwald) through Skype. He goes to a cafe and starts a fight with two men and the cafe owner Katya (Ana Ularu) saves him. Later, her brother Ivan suspects her of sleeping with Lucas. So she asks him to sleep with her. Lucas meets Pyotr's brother Andrei who tells him that Pyotr sold the diamonds to a man named Samsonov. Enraged, Lucas goes to Katya's home. They start a passionate affair."
    },
    {
      "title": "John Wick",
      "views": "100M",
      "genre": "Virtual Reality",
      "image": "../../../assets/john_wick.jpg",
      "duration": "03:05:00",
      "plot": "After John Wick loses his wife, Helen, to a terminal illness, he receives a beagle puppy named Daisy from his late wife to help him cope with his grief. Despite John's stoic demeanor, he bonds with the puppy and they spend their day driving around in his vintage 1969 Ford Mustang Mach 1. At a gas station he encounters a trio of Russian gangsters whose leader, Iosef, insists on buying his car, but John repeatedly states that it is not for sale. Angered, the mobsters follow John to his home, knock him unconscious, steal his car and kill Daisy. Iosef takes the Mustang to a chop shop to have the VIN changed. Aurelio, the shop's owner, recognizes the car and, upon learning that Iosef stole it from John, punches him before throwing him out of his shop. John visits Aurelio, who identifies Iosef as the son of Viggo Tarasov, the head of the Russian crime syndicate in New York City. Viggo, informed by Aurelio of Iosef's activities, beats and berates Iosef before explaining to him who John Wick is: a famed assassin formerly in Viggo's employ, nicknamed 'Baba Yaga' (translated in the film as Russian for 'Boogeyman'). When John wanted to retire and marry Helen, Viggo gave him an 'impossible task,' implied to involve multiple assassinations in a short period of time. John succeeded, and his efforts were key in establishing the Tarasov syndicate. Viggo tries to talk John out of seeking retribution, but John refuses. Viggo then sends a thirteen-man hit squad to John's house, but John kills them all and has the bodies professionally removed. An unsurprised Viggo places a $2 million bounty on John's head and personally offers the contract to John's mentor, Marcus. John seeks refuge at the Continental Hotel, which caters exclusively to the criminal underworld and permits no 'business' on its premises. Viggo doubles the bounty for those willing to break the rules to kill John at the Continental. Winston, the Continental's owner, tells John that Viggo has Iosef under guard at his nightclub, the Red Circle. John enters the Red Circle and kills his way to Iosef but Viggo's henchman, Kirill, waylays John, allowing Iosef to escape. John retreats to the Continental to patch up his injuries. Ms. Perkins, an assassin and former acquaintance, sneaks into John's room to kill him but Marcus alerts John, allowing him to subdue Perkins. He forces Perkins to reveal the location of Viggo's front, knocks her unconscious and leaves her with Harry, a fellow assassin, to await punishment."
    },
    {
      "title": "BattleShip",
      "views": "30M",
      "genre": "Sci-fi",
      "image": "../../../assets/battleship.jpg",
      "duration": "02:02:56",
      "plot": "In 2006, the distant Gliese planetary system is discovered to have a potentially habitable planet and a communications array is built by NASA in Hawaii to send a transmission to contact any intelligent life. Meanwhile, Alex Hopper is arrested while attempting to impress Sam Shane. His brother, naval officer Stone, forces Alex to join the U.S. Navy in order to improve his life. In 2012, Alex and Sam are in a relationship; Alex serves as a Tactical Actions Officer as a lieutenant aboard USS John Paul Jones while Stone is the commander aboard USS Sampson, but Alex is in danger of receiving a disciplinary discharge. During the 2012 RIMPAC exercise, five alien spacecraft arrive. Their communications ship collides with a satellite and crashes in Hong Kong while the other four land in the waters off Hawaii. Sampson, John Paul Jones, and their Japanese sister ship JDS Myōkō are ordered by Admiral Terrance Shane to investigate, and they discover a floating structure. When it is touched by Alex it generates a force field that encloses the Hawaiian Islands and separates the three ships from the RIMPAC fleet, and jams all radar and communication equipment in it. Three alien warships surface and in the ensuing engagement, the Sampson and Myōkō are both destroyed, resulting in Stone's death, while the command crew of John Paul Jones are killed. With Alex assuming command of the ship as the ranking officer, they recover the survivors from Myōkō including its commanding officer, Captain Yugi Nagata. The aliens also launch drones to attack Hawaii which cause heavy damage. On Oahu, Sam is accompanying retired U.S. Army lieutenant colonel and double amputee Mick Canales on a mountain hike."
    },
    {
      "title": "Love and BasketBall",
      "views": "1M",
      "genre": "Love",
      "image": "../../../assets/love_and_basketball.jpg",
      "duration": "02:10:34",
      "plot": "Monica and Quincy have wanted to be professional basketball stars since they were kids. The two became childhood sweethearts in 1981, when Monica’s family moved to Los Angeles from Atlanta, moving into the house next door to Quincy’s. Quincy's father, Zeke, is the star shooting guard for the Los Angeles Clippers. Quincy is shocked that a girl could love basketball as much as he does, and can play so well. They share their first kiss on the first day of school. The story jumps to 1988, when both Monica and Quincy are the respective leaders of their high school teams, with Quincy touted as one of the top prospects in the country. While popular with the girls, he and Monica are still good friends. Monica, on the other hand, struggles with her fiery emotions on the court, often resulting in technical fouls at critical moments of games, damaging potential scouting opportunities. Monica also struggles with the emotions she secretly still harbors for Quincy. She also struggles with her mother, Camille, pressuring her to give up basketball and 'act like a lady.'"
    },
    {
      "title": "Life",
      "views": "200k",
      "image": "../../../assets/Life.jpg",
      "genre": "Horror",
      "duration": "01:05:00",
      "plot": "In the near future, the unmanned Pilgrim 7 space probe returns from Mars to Earth orbit with soil samples potentially containing evidence of extraterrestrial life. The probe is captured and its samples retrieved by the International Space Station and its six-member crew. Exobiologist Hugh Derry, who is paralyzed from the waist down, revives a dormant cell from the sample, which quickly grows into a multi-celled organism that American school children name 'Calvin.' Hugh realizes that Calvin's cells can change their specialization, acting as muscle, neuron, and photosensory cells all at once. An accident in the lab causes Calvin to become dormant; Hugh attempts to revive Calvin with electric shocks, but Calvin immediately becomes hostile and attacks Hugh, crushing his right hand. While Hugh lies unconscious from Calvin's attack, Calvin uses Hugh's electric shock tool to escape its enclosure; now free in the laboratory, Calvin devours a lab rat by absorbing it, growing in size. Engineer Rory Adams enters the lab to rescue Hugh; however, he is locked in by fellow crew member and physician David Jordan to keep Calvin contained, after it latches onto Rory's leg. He fights Calvin off by burning it with an exposed element from a handheld light. Rory then, unsuccessfully, attacks Calvin with an incinerator component removed from a lab station; Calvin enters his mouth, devouring his organs from the inside and killing him. Emerging from Rory's mouth even larger, Calvin escapes through a fire-control vent that has been set off. Finding their communication with Earth cut off due to overheating of the communication systems, ISS commander Ekaterina Golovkina performs a space walk to find and fix the problem."
    }
  ]
}
